#include <iostream>
using namespace std;

int main()
{
    setlocale(LC_ALL, "");

    /*
    Задание 1. Напишите программу, которая создает двухмерный массив и заполняет его по следующему принципу:
    пользователь вводит число (например, 3) первый элемент
    массива принимает значение этого числа, последующий элемент массива принимает значение этого числа
    умноженного на 2 (т.е. 6 для нашего примера), третий
    элемент массива предыдущий элемент умноженный на
    2 (т.е. 6*2=12 для нашего примера). Созданный массив
    вывести на экран.
    */
    const int  row{ 5 }, col{ 5 };
    int number{};
    int mass[row][col]{};

    cout << "Введите первый элемент массива: ";
    cin >> number;

    mass[0][0] = number;

    for (int i{};i < row;i++) {
        for (int j{1};j < col;j++) {
            mass[i][j] = mass[i][j-1] * 2;
            for (int k{ 1 };k < row;k++) {
                mass[k][0] = mass[k - 1][col-1] * 2;
            }
        }
    }

    for (int i{};i < row;i++) {
        for (int j{};j < col;j++) {
            cout << mass[i][j] << " ";
        }
        cout << endl;
    }

}
