#include <iostream>
using namespace std;

int main()
{
    setlocale(LC_ALL, "");

    /*
    Задачу 3 делали в классе
    */

    /*
    ЗАДАНИЕ 4
    Известны данные курса валют (курс доллара по отношению
    к евро) за все месяцы года и начисленные проценты за каждый месяц на депозитном счету в евро. Все данные вводятся
    пользователем, в том числе и сумма на депозите в евро.
    Написать программу, которая по запросу пользователя
    (номер месяца) выводит в консоль размер допустимой суммы,
    которую он может обналичить, при условии, что у него долларовая карта, обналичить можно не более 50% от начисленной
    суммы в том случае, если начисленная сумма в этот месяц
    составляет не менее 500$.
    */

    float deposit{}, interest_rate{}, accrued_amount{};
    int month{};
    float exchange_rate[12]{};

    cout << "Введите сумму на депозите (в евро): ";
    cin >> deposit;
    cout << "\nВведите процентную ставку по депозиту: ";
    cin >> interest_rate;

    for (int i{ 0 }; i < 12; i++) {
        cout << "\nКурс доллара к евро за " << i + 1 << " месяц: ";
        cin >> exchange_rate[i];
    }

    do {
        cout << "\nВведите номер месяца: ";
        cin >> month;
        accrued_amount = (deposit * interest_rate) / (1200 * exchange_rate[month - 1]);
        if (accrued_amount < 500) {
            cout << "\nВы можете обналичить: " << accrued_amount << " $" << endl;
            cout << "\nВведите 0 для выхода из программы" << endl;
        }
        else {
            cout << "\nВы можете обналичить: " << accrued_amount / 2 << " $" << endl;
            cout << "\nВведите 0 для выхода из программы" << endl;
        }
        
    } while (month != 0);
}
