#include <iostream>
using namespace std;

int main()
{
    setlocale(LC_ALL, "");

    srand(time(NULL));

    int task{5};
    int mass1[10]{}, mass2[5]{}, mass3[5]{}; // Задача 1
    int arr1[10]{}, arr2[10]{}, arr3[10]{}; // Задача 2

    cout << "1 - Задача 1" << endl;
    cout << "2 - Задача 2" << endl;
    cout << "0 - Выход из программы" << endl;

    while (task!=0) {
        cout << "\nВведите номер задания: ";
        cin >> task;
        cout << endl;

        switch (task)
        {
        case 1:
            /*
            ЗАДАНИЕ 1
            Написать программу, копирующую последовательно элементы
            одного массива размером 10 элементов в 2 массива размером
            5 элементов каждый. Элементы первоначального массива можно
            сгенерировать в произвольном диапазоне.
            */
            cout << "Первоначальный массив: ";
            for (int i{};i < 10;i++) {
                mass1[i] = rand() % 100 + 0;
                cout << mass1[i] << " ";
            }

            cout << endl;
            cout << "Первый массив: ";

            for (int j{};j < 5;j++) {
                mass2[j] = mass1[j];
                cout << mass2[j] << " ";
            }

            cout << endl;
            cout << "Второй массив: ";

            for (int j{};j < 5;j++) {
                mass3[j] = mass1[j + 5];
                cout << mass3[j] << " ";
            }
            break;
        case 2:
            /*
            ЗАДАНИЕ 2
            Напишите программу, которая выполняет поэлементную
            сумму двух массивов и результат заносит в третий массив.
            Элементы массивов можно сгенерировать в произвольном
            диапазоне.
            */
            cout << "Первый массив: ";

            for (int i{}; i < 10; i++) {
                arr1[i] = rand() & 100 + 0;
                cout << arr1[i] << " ";
            }

            cout << endl;
            cout << "Второй массив: ";

            for (int i{}; i < 10; i++) {
                arr2[i] = rand() & 100 + 0;
                cout << arr2[i] << " ";
            }

            cout << endl;

            for (int i{};i < 10;i++) {
                arr3[i] = arr1[i] + arr2[i];
                cout << arr1[i] << " + " << arr2[i] << " = " << arr3[i] << endl;
            }

            cout << "Результат: ";

            for (int i{};i < 10;i++) {
                arr3[i] = arr1[i] + arr2[i];
                cout << arr3[i] << " ";
            }
            break;
        default:
            break;
        }
    }
    

}


