#include <iostream>
using namespace std;

int main()
{
    setlocale(LC_ALL, "");

    int task{10};
    int number{ 1 }, choise{ 1 }, digit{}, digits{}, zeros{}; // переменные задания 1
    float mean{}, sum{}; // переменные задания 1
    int N{ 1 }; // переменная задания 2
    int clients{}, product{ 9 }, sum_all{}; // переменные задания 3

    while (task != 0) {
        cout << "\nВведите 0 для выхода из программы\n";
        cout << "\nВведите номер задания: ";
        cin >> task;
        cout << endl;
        switch (task)
        {
        case 1:
            /* Задание 1
            Пользователь вводит число. Определить количество цифр в этом числе, посчитать их сумму и среднее арифметическое.
            Определить количество нулей в этом числе. Общение с пользователем организовать через меню.*/
            cout << "\nВведите число: ";
            cin >> number;
            while (choise != 0) {
                cout << "\nВыберите номер пункта:" << endl;
                cout << "\n0 - Выход из программы" << endl;
                cout << "1 - Количество цифр в числе" << endl;
                cout << "2 - Сумма цифр числа" << endl;
                cout << "3 - Среднее арифметическое цифр числа" << endl;
                cout << "4 - Количество нулей в числе" << endl;
                cout << "\nВыберите номер пункта: ";
                cin >> choise;
                while (number != 0)
                {
                    digit = number % 10;
                    sum += digit;
                    digits++;
                    if (digit == 0) zeros++;
                    number /= 10;
                    mean = sum / digits;
                }
                switch (choise)
                {
                case 1:
                    cout << "\nВ данном числе: " << digits << " цифр(ы)" << endl;
                    break;
                case 2:
                    cout << "\nСумма цифр числа: " << sum << endl;
                    break;
                case 3:
                    cout << "\nСреднее арифметическое цифр числа: " << mean << endl;
                    break;
                case 4:
                    cout << "\nКоличество нулей в числе: " << zeros << endl;
                    break;
                default:
                    choise == 0 ? cout << "\nВыход" << endl : cout << "\nОшибка!" << endl;
                    break;
                }
            }
            break;
        case 2:
            /* Задание 2.
            Написать программу, которая выводит на экран шахматную доску с заданным размером клеточки. */
            cout << "Введите размер клетки: ";
            cin >> N;
            cout << endl;
            for (int m{ 1 }; m <= 8; m++) {
                if (m % 2 == 0) { //четные и нечетные строки
                    for (int j{ 1 }; j <= N; j++) {
                        for (int i{ 1 }; i <= 4; i++) { //каждый из двух циклов отработал по 4 раза
                            for (int k{ 1 }; k <= N; k++) {
                                cout << "-";
                            }
                            for (int k{ 1 }; k <= N; k++) {
                                cout << "*";
                            }
                        }
                        cout << endl;
                    }
                }
                else {
                    for (int j{ 1 }; j <= N; j++) {
                        for (int i{ 1 }; i <= 4; i++) { //каждый из двух циклов отработал по 4 раза
                            for (int k{ 1 }; k <= N; k++) {
                                cout << "*";
                            }
                            for (int k{ 1 }; k <= N; k++) {
                                cout << "-";
                            }
                        }
                        cout << endl;
                    }
                }
            }
            break;
        case 3:
            /* Задание 3
            Реализовать программу расчета заказа в кафетерии при условии, что заказ может быть на несколько человек и каждый клиент формирует свою часть заказа.
            Необходимо спросить у пользователя на сколько человек заказ. Далее каждому человеку выводиться меню (названия напитков, кондитерских изделий и их цена)
            и он выбирает. Предусмотреть возможность выбора нескольких элементов меню для клиента, если он желает добавить еще что-то в свой заказ.
            Результат работы программы — итоговая сумма общего заказа всей компании.*/
            cout << "На сколько человек заказ: ";
            cin >> clients;
            for (int i{ 1 }; i <= clients; i++) {
                cout << "Сладкое: " << endl;
                cout << "1 - КАПКЕЙКИ - 180" << endl;
                cout << "2 - ПОНЧИКИ - 150" << endl;
                cout << "3 - КЕЙКПОПСЫ - 100" << endl;
                cout << "4 - БРАУНИ - 180" << endl;
                cout << "Напитки: " << endl;
                cout << "5 - ЧАЙ - 50" << endl;
                cout << "6 - КОФЕ - 100" << endl;
                cout << "7 - ВОДА - 30" << endl;
                cout << "0 - Следующий клиент/Конец заказа" << endl;
                do {
                    cin >> product;
                    switch (product) {
                    case 1:
                        sum_all += 180;
                        break;
                    case 2:
                        sum_all += 150;
                        break;
                    case 3:
                        sum_all += 100;
                        break;
                    case 4:
                        sum_all += 180;
                        break;
                    case 5:
                        sum_all += 50;
                        break;
                    case 6:
                        sum_all += 100;
                        break;
                    case 7:
                        sum_all += 30;
                        break;
                    default:
                        break;

                    }
                } while (product != 0);
            }
            cout << "Сумма заказа: " << sum_all << endl;
            break;
        case 4:
            /* Задание 4.
            Есть пустое поле игры «Морской бой». Вывести в консоль номера полей игры.*/
            for (int i{ 0 }; i <= 9; i++) {
                for (char j = 'A'; j <= 'J'; j++) {
                    cout << j << i << " ";
                }
                cout << endl;
            }
            break;
        default:
            break;
        }
    }
}