#include <iostream>
using namespace std;

int main()
{
    setlocale(LC_ALL, "");
    /*ЗАДАНИЕ 1
        Напишите программу, которая вычисляет сумму целых
        чисел от а до 500 (значение a вводится с клавиатуры).*/
    cout << "Задание 1\n";
    int a{}, sum{};
    cout << "Введите начало диапазона: ";
    cin >> a;
    while (a <= 500) {
        sum += a;
        a++;
    }
    cout << "Сумма: " << sum;
    /*ЗАДАНИЕ 2
        Напишите программу, которая запрашивает два целых числа
        x и y, после чего вычисляет и выводит значение x в степени y.*/
    cout << "\nЗадание 2\n";
    int x{}, y{}, res{1};
    cout << "Введите число: ";
    cin >> x;
    cout << "Введите степень: ";
    cin >> y;
    while (y > 0) {
        res *= x;
        y--;
    }
    cout << "Результат: " << res;
    /*ЗАДАНИЕ 3
        Найти среднее арифметическое всех целых чисел от 1 до 1000.*/
    cout << "\nЗадание 3\n";
    float res_sum{}, res_final{};
    for (int i{1};i<=1000;i++) {
        res_sum += i;
        res_final = res_sum / i;
    }
    cout << "Результат: " << res_final;
    /*ЗАДАНИЕ 4
        Найти произведение всех целых чисел от a до 20 (значение
            a вводится с клавиатуры : 1 <= a <= 20).*/
    cout << "\nЗадание 4\n";
    int a1{}, res1{1};
    cout << "Введите начало диапазона: ";
    cin >> a1;
    if (a1 >= 1 && a1 <= 20) {
        while (a1 <= 20) {
            res1 *= a1;
            a1++;
        }
        cout << "Результат: " << res1;
    }
    else {
        cout << "Ошибка!";
    }
    /*ЗАДАНИЕ 5
        Написать программу, которая выводит на экран таблицу
        умножения на k, где k — номер варианта.*/
    cout << "\nЗадание 5\n";
    int k{1};
    cout << "Введите номер варианта: ";
    cin >> k;
    for (int i{1};i<=10;i++) {
        cout << k << " x " << i << " = " << k * i << endl;
    }
}